.bin/k6-async-15CCUs.log
    done [==========================================================] 15 / 15

    ✗ OK
     ↳  60% — ✓ 9 / ✗ 6

    checks.....................: 60.00% ✓ 9    ✗ 6
    data_received..............: 3.9 kB 656 B/s
    data_sent..................: 1.5 kB 253 B/s
    http_req_blocked...........: avg=1.43ms   min=959.1µs med=1ms   max=1.96ms p(90)=1.96ms   p(95)=1.96ms
    http_req_connecting........: avg=1.3ms    min=959.1µs med=1ms   max=1.96ms p(90)=1.96ms   p(95)=1.96ms
    http_req_duration..........: avg=5.21s    min=3.82s   med=5.57s max=5.97s  p(90)=5.97s    p(95)=5.97s
    http_req_receiving.........: avg=133.73µs min=0s      med=0s    max=1ms    p(90)=601.01µs p(95)=1ms
    http_req_sending...........: avg=200.48µs min=0s      med=0s    max=1ms    p(90)=1ms      p(95)=1ms
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s    max=0s     p(90)=0s       p(95)=0s
    http_req_waiting...........: avg=5.21s    min=3.82s   med=5.57s max=5.97s  p(90)=5.97s    p(95)=5.97s
    http_reqs..................: 15     2.509707/s
    iteration_duration.........: avg=5.21s    min=3.82s   med=5.58s max=5.97s  p(90)=5.97s    p(95)=5.97s
    iterations.................: 15     2.509707/s
    vus........................: 15     min=15 max=15
    vus_max....................: 15     min=15 max=15

C1 ------------------------------------
2019-09-07 15:52:41.866  INFO 27924 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S3/3]  @(1567846361820)
2019-09-07 15:52:43.479  INFO 27924 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S1/5]  @(1567846363477)
2019-09-07 15:52:44.497  INFO 27924 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S1/8]  @(1567846364496)
2019-09-07 15:52:45.507  INFO 27924 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S1/11]  @(1567846365506)
2019-09-07 15:52:46.519  INFO 27924 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S1/14]  @(1567846366518)

C2 ------------------------------------
	2019-09-07 15:52:41.864  INFO 17628 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S2/2]  @(1567846361820)
	2019-09-07 15:52:43.491  INFO 17628 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S3/6]  @(1567846363489)
2019-09-07 15:52:44.505  INFO 17628 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S3/9]  @(1567846364504)
2019-09-07 15:52:45.517  INFO 17628 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S3/12]  @(1567846365515)
2019-09-07 15:52:46.526  INFO 17628 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S3/15]  @(1567846366526)

C3 ------------------------------------
	2019-09-07 15:52:41.865  INFO 17560 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S1/1]  @(1567846361820)
2019-09-07 15:52:42.714 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6379, CreateTime = 1567846362389, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-39, -25, -59, 120, -36, -16, 69, -53, -108, 31, -82, -16, 76, 118, 64, -126]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/1]  @(1567846361820))) with correlationId: [-50636466050841578814210668786176606078], perhaps timed out
2019-09-07 15:52:42.773 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6380, CreateTime = 1567846362431, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-42, 1, -123, -74, 1, 94, 75, -53, -97, -127, -122, -43, 112, -60, -17, 67]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/3]  @(1567846361820))) with correlationId: [-55819671545681586595521540653143756989], perhaps timed out
2019-09-07 15:52:42.774 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6381, CreateTime = 1567846362445, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [67, -12, 62, -74, -6, -99, 68, -8, -102, 34, 76, -29, -58, -121, 37, 124]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/2]  @(1567846361820))) with correlationId: [90326468157554244941427894447380047228], perhaps timed out
2019-09-07 15:52:43.410  INFO 17560 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S2/4]  @(1567846363408)
2019-09-07 15:52:43.476 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6382, CreateTime = 1567846363411, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [67, -10, -44, 96, 96, 6, 79, 68, -127, 102, -27, -58, 105, 100, 49, -49]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/4]  @(1567846363408))) with correlationId: [90339888251246695433101811738963358159], perhaps timed out
2019-09-07 15:52:43.537 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6383, CreateTime = 1567846363481, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-50, 52, 0, 58, -121, 33, 77, 26, -81, 87, -83, 50, -66, 42, 32, -105]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/5]  @(1567846363477))) with correlationId: [-66191395715547821788777035146546503529], perhaps timed out
2019-09-07 15:52:43.598 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6384, CreateTime = 1567846363492, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [0, 39, 48, 119, -4, -104, 65, -56, -118, -119, 49, -87, 9, 100, -47, -72]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/6]  @(1567846363489))) with correlationId: [203482639469462607862359329801032120], perhaps timed out
	2019-09-07 15:52:44.425  INFO 17560 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S2/7]  @(1567846364424)
2019-09-07 15:52:44.480 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6385, CreateTime = 1567846364426, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-4, 107, 93, 0, -10, -110, 68, -106, -91, 19, -51, 111, -124, -89, -67, 7]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/7]  @(1567846364424))) with correlationId: [-4759449878873157844470892161748452089], perhaps timed out
2019-09-07 15:52:44.552 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6386, CreateTime = 1567846364498, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [11, -118, -14, -125, -119, 91, 70, -26, -79, -97, -50, -7, 6, 127, 40, 88]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/8]  @(1567846364496))) with correlationId: [15342963684635047303863225879101384792], perhaps timed out
2019-09-07 15:52:44.608 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6387, CreateTime = 1567846364506, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-48, -24, -25, 114, -96, -90, 67, 115, -120, -36, -27, 92, 52, 83, -58, -27]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/9]  @(1567846364504))) with correlationId: [-62593636608148309940298076616013920539], perhaps timed out
	2019-09-07 15:52:45.435  INFO 17560 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S2/10]  @(1567846365434)
2019-09-07 15:52:45.490 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6388, CreateTime = 1567846365436, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [44, -40, 75, 92, -48, -24, 64, -57, -74, -52, 110, -29, -109, 12, -61, 89]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/10]  @(1567846365434))) with correlationId: [59609096470344705111650320031972901721], perhaps timed out
2019-09-07 15:52:45.562 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6389, CreateTime = 1567846365509, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-105, 90, -107, 7, -21, 58, 66, -89, -126, -120, -97, 59, 29, 19, 9, -63]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/11]  @(1567846365506))) with correlationId: [-139098610133720540697834653118018418239], perhaps timed out
2019-09-07 15:52:45.617 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6390, CreateTime = 1567846365518, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [89, 51, -117, -59, 40, -65, 64, 26, -88, -36, 121, -81, 115, 103, -116, -110]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/12]  @(1567846365515))) with correlationId: [118568933640136319737395498856640646290], perhaps timed out
	2019-09-07 15:52:46.446  INFO 17560 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK-null: -> [REPLY-S2/13]  @(1567846366446)
2019-09-07 15:52:46.501 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6391, CreateTime = 1567846366447, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [100, 22, 37, 65, -98, -52, 70, 95, -127, 72, 119, -108, -60, -93, 3, -33]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/13]  @(1567846366446))) with correlationId: [133037785757510836783580226973713236959], perhaps timed out
2019-09-07 15:52:46.574 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6392, CreateTime = 1567846366520, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-60, 100, 28, 125, -99, 109, 69, -71, -79, -37, 105, 94, -63, -29, -41, -61]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/14]  @(1567846366518))) with correlationId: [-79233872201531004356521209235934816317], perhaps timed out
2019-09-07 15:52:46.624 ERROR 17560 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6393, CreateTime = 1567846366527, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [1, 32, -64, 44, -107, 115, 74, -60, -120, -64, -122, -35, -45, -106, -88, -30]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/15]  @(1567846366526))) with correlationId: [1499279250193728118540727598880041186], perhaps timed out

BACKEND ------------------------------------
2019-09-07 15:52:41.820  INFO 12916 --- [nio-2010-exec-3] io.project.resources.TestController      : #S2 REQUEST-2() @1567846361820
2019-09-07 15:52:41.820  INFO 12916 --- [nio-2010-exec-1] io.project.resources.TestController      : #S1 REQUEST-1() @1567846361820
2019-09-07 15:52:41.821  INFO 12916 --- [nio-2010-exec-2] io.project.resources.TestController      : #S3 REQUEST-3() @1567846361820
2019-09-07 15:52:43.408  INFO 12916 --- [nio-2010-exec-4] io.project.resources.TestController      : #S2 REQUEST-4() @1567846363408
2019-09-07 15:52:43.477  INFO 12916 --- [nio-2010-exec-5] io.project.resources.TestController      : #S1 REQUEST-5() @1567846363477
2019-09-07 15:52:43.489  INFO 12916 --- [nio-2010-exec-6] io.project.resources.TestController      : #S3 REQUEST-6() @1567846363489
2019-09-07 15:52:44.424  INFO 12916 --- [nio-2010-exec-7] io.project.resources.TestController      : #S2 REQUEST-7() @1567846364424
2019-09-07 15:52:44.496  INFO 12916 --- [nio-2010-exec-8] io.project.resources.TestController      : #S1 REQUEST-8() @1567846364496
2019-09-07 15:52:44.504  INFO 12916 --- [nio-2010-exec-9] io.project.resources.TestController      : #S3 REQUEST-9() @1567846364504
2019-09-07 15:52:45.434  INFO 12916 --- [io-2010-exec-10] io.project.resources.TestController      : #S2 REQUEST-10() @1567846365434
2019-09-07 15:52:45.506  INFO 12916 --- [nio-2010-exec-2] io.project.resources.TestController      : #S1 REQUEST-11() @1567846365506
2019-09-07 15:52:45.515  INFO 12916 --- [nio-2010-exec-3] io.project.resources.TestController      : #S3 REQUEST-12() @1567846365515
2019-09-07 15:52:46.446  INFO 12916 --- [nio-2010-exec-1] io.project.resources.TestController      : #S2 REQUEST-13() @1567846366446
2019-09-07 15:52:46.518  INFO 12916 --- [nio-2010-exec-4] io.project.resources.TestController      : #S1 REQUEST-14() @1567846366518
2019-09-07 15:52:46.526  INFO 12916 --- [nio-2010-exec-5] io.project.resources.TestController      : #S3 REQUEST-15() @1567846366526

PRODUCER ---------------------------------- (FAILED 1, 2, 6, 7, 10, 13)
2019-09-07 15:52:43.037  INFO 17960 --- [nio-2001-exec-9] io.project.resources.InfoController      : ASync-REQUEST[3]() 200: [REPLY-S2/2]  @(1567846361820)
2019-09-07 15:52:44.478  INFO 17960 --- [nio-2001-exec-1] io.project.resources.InfoController      : ASync-REQUEST[4]() 200: [REPLY-S2/7]  @(1567846364424)
2019-09-07 15:52:43.537  INFO 17960 --- [io-2001-exec-10] io.project.resources.InfoController      : ASync-REQUEST[5]() 200: [REPLY-S1/5]  @(1567846363477)
2019-09-07 15:52:43.037  INFO 17960 --- [io-2001-exec-14] io.project.resources.InfoController      : ASync-REQUEST[8]() 200: [REPLY-S3/3]  @(1567846361820)
2019-09-07 15:52:42.771  INFO 17960 --- [nio-2001-exec-5] io.project.resources.InfoController      : ASync-REQUEST[9]() 200: [REPLY-S1/1]  @(1567846361820)
2019-09-07 15:52:44.550  INFO 17960 --- [nio-2001-exec-7] io.project.resources.InfoController      : ASync-REQUEST[11]() 200: [REPLY-S1/8]  @(1567846364496)
2019-09-07 15:52:43.586  INFO 17960 --- [io-2001-exec-11] io.project.resources.InfoController      : ASync-REQUEST[12]() 200: [REPLY-S3/6]  @(1567846363489)
2019-09-07 15:52:44.598  INFO 17960 --- [nio-2001-exec-8] io.project.resources.InfoController      : ASync-REQUEST[14]() 200: [REPLY-S3/9]  @(1567846364504)
2019-09-07 15:52:43.464  INFO 17960 --- [nio-2001-exec-6] io.project.resources.InfoController      : ASync-REQUEST[15]() 200: [REPLY-S2/4]  @(1567846363408)
2019-09-07 15:52:44.783  WARN 17960 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.qc, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 113, 99]), RecordHeader(key = kafka_correlationId, value = [-105, 90, -107, 7, -21, 58, 66, -89, -126, -120, -97, 59, 29, 19, 9, -63]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-139098610133720540697834653118018418239]
2019-09-07 15:52:44.791  WARN 17960 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.qc, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 113, 99]), RecordHeader(key = kafka_correlationId, value = [-60, 100, 28, 125, -99, 109, 69, -71, -79, -37, 105, 94, -63, -29, -41, -61]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-79233872201531004356521209235934816317]
2019-09-07 15:52:44.792  WARN 17960 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.qc, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 113, 99]), RecordHeader(key = kafka_correlationId, value = [1, 32, -64, 44, -107, 115, 74, -60, -120, -64, -122, -35, -45, -106, -88, -30]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [1499279250193728118540727598880041186]
2019-09-07 15:52:44.801  WARN 17960 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.qc, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 113, 99]), RecordHeader(key = kafka_correlationId, value = [44, -40, 75, 92, -48, -24, 64, -57, -74, -52, 110, -29, -109, 12, -61, 89]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [59609096470344705111650320031972901721]
2019-09-07 15:52:44.801 ERROR 17960 --- [io-2001-exec-15] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 15:52:44.801 ERROR 17960 --- [nio-2001-exec-2] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 15:52:44.802 ERROR 17960 --- [io-2001-exec-12] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 15:52:44.802  WARN 17960 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.qc, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 113, 99]), RecordHeader(key = kafka_correlationId, value = [89, 51, -117, -59, 40, -65, 64, 26, -88, -36, 121, -81, 115, 103, -116, -110]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [118568933640136319737395498856640646290]
2019-09-07 15:52:44.803 ERROR 17960 --- [nio-2001-exec-4] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 15:52:44.818  WARN 17960 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.qc, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 113, 99]), RecordHeader(key = kafka_correlationId, value = [100, 22, 37, 65, -98, -52, 70, 95, -127, 72, 119, -108, -60, -93, 3, -33]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [133037785757510836783580226973713236959]
2019-09-07 15:52:44.819 ERROR 17960 --- [io-2001-exec-13] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 15:52:44.831 ERROR 17960 --- [nio-2001-exec-3] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 15:52:45.507 ERROR 17960 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6388, CreateTime = 1567846365436, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [44, -40, 75, 92, -48, -24, 64, -57, -74, -52, 110, -29, -109, 12, -61, 89]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/10]  @(1567846365434))) with correlationId: [59609096470344705111650320031972901721], perhaps timed out
2019-09-07 15:52:45.608 ERROR 17960 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6389, CreateTime = 1567846365509, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-105, 90, -107, 7, -21, 58, 66, -89, -126, -120, -97, 59, 29, 19, 9, -63]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/11]  @(1567846365506))) with correlationId: [-139098610133720540697834653118018418239], perhaps timed out
2019-09-07 15:52:45.658 ERROR 17960 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6390, CreateTime = 1567846365518, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [89, 51, -117, -59, 40, -65, 64, 26, -88, -36, 121, -81, 115, 103, -116, -110]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/12]  @(1567846365515))) with correlationId: [118568933640136319737395498856640646290], perhaps timed out
2019-09-07 15:52:46.500 ERROR 17960 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6391, CreateTime = 1567846366447, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [100, 22, 37, 65, -98, -52, 70, 95, -127, 72, 119, -108, -60, -93, 3, -33]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/13]  @(1567846366446))) with correlationId: [133037785757510836783580226973713236959], perhaps timed out
2019-09-07 15:52:46.635 ERROR 17960 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6392, CreateTime = 1567846366520, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-60, 100, 28, 125, -99, 109, 69, -71, -79, -37, 105, 94, -63, -29, -41, -61]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/14]  @(1567846366518))) with correlationId: [-79233872201531004356521209235934816317], perhaps timed out
2019-09-07 15:52:46.738 ERROR 17960 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.qc, partition = 0, offset = 6393, CreateTime = 1567846366527, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [1, 32, -64, 44, -107, 115, 74, -60, -120, -64, -122, -35, -45, -106, -88, -30]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/15]  @(1567846366526))) with correlationId: [1499279250193728118540727598880041186], perhaps timed out